Revit 2026 API

# AdvancedOpaqueSurfaceNormal Property

---

The property labeled "Image" from the "AdvancedOpaque" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SurfaceNormal { get; }
```
```vb
Public Shared ReadOnly Property SurfaceNormal As String
	Get
```
```cpp
public:
static property String^ SurfaceNormal {
	String^ get ();
}
```
```fsharp
static member SurfaceNormal : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace